Repository: evtaa/FocusStartHomeworks
Catalog: myCV/myCV/Resources/*.lproj/Localizable.strings
Languages: ru

# personalInfo
source: Personal
ru: Персональное

source: Profile
ru: Профайл

source: Interests
ru: Интересы

# name
source: Alexander Evtodiy
ru: Евтодий Александр Александрович

# address
source: Saint-Petersburg, Russia
ru: Россия, Санкт-Петербург

# nationality
source: Russian
ru: Русский

# firstHeaderInfoOfEducationItem
source: St. Petersburg State Electrotechnical University "LETI" named after V.I. Ulyanov (Lenin), St. Petersburg
ru: Санкт-Петербургский государственный электротехнический университет "ЛЭТИ" им. В.И. Ульянова (Ленина), Санкт-Петербург

# firstInfoOfEducationItem
source: Faculty of Electrical Engineering and Automation, Department of Automatic Control Systems (ACS), 220200 «Automation and Control», Baccalaureate
ru: Факультет электротехники и автоматики, кафедра систем автоматического управления (САУ), 220200 «Автоматизация и управление», бакалавр

# secondHeaderInfoOfEducationItem
source: St. Petersburg State Electrotechnical University "LETI" named after V.I. Ulyanov (Lenin), St. Petersburg
ru: Санкт-Петербургский государственный электротехнический университет "ЛЭТИ" им. В.И. Ульянова (Ленина), Санкт-Петербург

# secondInfoOfEducationItem
source: Faculty of Electrical Engineering and Automation, Department of Automatic Control Systems (ACS), «Electrification and Automation of ships», Master's degree
ru: Факультет электротехники и автоматики, кафедра систем автоматического управления (САУ), «Электрофикация и автоматизация судов», магистр

# thirdHeaderInfoOfEducationItem
source: GeekBrains
ru: Гикбрейнс

# thirdInfoOfEducationItem
source: Faculty of iOS Development
ru: Факультете iOS разработки

# demoProfile
source: Welcome. I am an iOS developer who wants to use and develop my app development skills.
ru: Очень приятно Вам представиться. Я iOS разработчик, желающий использовать и развивать свое умение разрабатывать приложения.

# info
source: - I know the principles of OOP, SOLID - Experience in developing custom UI - Ability to work with the GCD library, Operation - Work with the network. With network protocols HTTP, TCP. Ownership of the Alamofire, URLSession libraries. - Understanding the principles of the basic architectural patterns of MVC, MVVM, MVP, VIPER. - Worked with KeyChain, Userdefaults, Sandbox, Realm, FirebaseDatabase - Little experience with GoogleMaps - I own the iOS SDK, the main frameworks (Foundation, UIKit) - I own a version control system (Git), GitFlow, SwiftLint. - Intermediate English
ru: - Владею принципами ООП, SOLID - Опыт разработки кастомных UI - Умение работать с библиотекой GCD, Operation - Работа с сетью. С сетевыми протоколами HTTP, TCP. Владение библиотеками Alamofire, URLSession. - Понимание принципов основных архитектурных паттернов MVC, MVVM, MVP, VIPER. - Работал с KeyChain, Userdefaults, песочница, Realm, FirebaseDataBase - Небольшой опыт работы с GoogleMaps - Владею iOS SDK, основными фреймворками (Foundation, UIKit) - Владею системой контроля версий (Git), GitFlow, SwiftLint. - Английский на среднем уровне (Intermidate)

# additionalInfo
source: Also, as part of my current work, I known C, Assembler, Verilog. As part of his studies at GeekBrains University, he was engaged in the development of mobile applications: 1) A client for a social network in Vkontakte on Swift 2) Online store template on Swift 3) Location Tracker on Swift 4) Flight search apps for Objective C
ru: Также в рамках текущей работы владею языками С, Assembler, Verilog. В рамках обучения в университете GeekBrains занимался разработкой мобильных приложений: 1) Клиент для социальной сети в Вконтакте на Swift 2) Шаблон онлайн магазина на Swift 3) Трекер местоположения на Swift 4) Приложения для поиска авиабилетов на Objective C

# firstCompanyOfWorkExperienceItem
source: Branch of "Central Research Institute of Marine Electrical Engineering and Technology" "KGNC"
ru: Филиал "Центрального научно-исследовательского института судовой электротехники и технологии" "КГНЦ"

# firstPositionOfWorkExperienceItem
source: enginier
ru: инженер

# firstResponsibilitiesOfWorkExperienceItem
source: Development of mathematical models of electric propulsion systems
ru: Разработка математических моделей систем электродвижения

# secondCompanyOfWorkExperienceItem
source: Branch of "Central Research Institute of Marine Electrical Engineering and Technology" "KGNC"
ru: Филиал "Центрального научно-исследовательского института судовой электротехники и технологии" "КГНЦ"

# secondPositionOfWorkExperienceItem
source: lead engineer
ru: ведущий инженер

# secondResponsibilitiesOfWorkExperienceItem
source: - Mathematical modeling of electric propulsion systems in MATLAB Simulink - Development of algorithms for controlling frequency converters - Software development for microcontrollers using the C language - Software development for FPGAs using the Verilog language - Implementation of information exchange via RS-485 (Modbus RTU), SPI (information exchange, sensor polling) - Development of documentation for equipment and software
ru: - Математическое моделирование систем электродвижения в MATLAB Simulink - Разработка алгоритмов управления преобразователями частоты - Разработка программного обеспечения для микроконтроллеров с использованием языка С - Разработка программного обеспечения для ПЛИС с использованием языка Verilog - Реализация обмена информацией по RS-485 (Modbus RTU), SPI (обмен информацией, опрос датчиков) - Разработка документации на оборудование и ПО

# thirdCompanyOfWorkExperienceItem
source: Branch of "Central Research Institute of Marine Electrical Engineering and Technology" "KGNC"
ru: Филиал "Центрального научно-исследовательского института судовой электротехники и технологии" "КГНЦ"

# thirdPositionOfWorkExperienceItem
source: head of department
ru: начальник сектора

# thirdResponsibilitiesOfWorkExperienceItem
source: - Management of a six-person sector - Work planning - Project management for the development of electrical equipment - Software development
ru: - Руководство сектором из шести человек - Планирование работ - Ведение проекта по разработке электротехнического оборудования - Разработка ПО

# nameIs
source: Name
ru: Имя

# ageIs
source: Age
ru: Возраст

# addressIs
source: Address
ru: Адрес

# mobileIs
source: Phone number
ru: Номер телефона

# nationalityIs
source: Nationality
ru: Национальность

# emailIs
source: Email
ru: Электронный адрес

# segmentCommon
source: Common
ru: Общее

# segmentEducation
source: Education
ru: Образование

# segmentProfile
source: Profile
ru: Справка

# segmentWorkExperience
source: Experience
ru: Опыт

# year
source: years
ru: лет

# month
source: months
ru: месяца

# segmentInterests
source: Interests
ru: Интересы

# segmentPhoto
source: Photos
ru: Фото

# interestsInfo
source: One of my main hobbies is programming. In addition, if there is time left, there are others: - intres to software and technical innovations - study of professional literature - I play basketball - skiing - I go swimming - I'm going out of town with tents - I work out sometimes in the gym - I ride a bike - I go fishing - generating fireball discharges
ru: Одним из главных моих увлечений является программирование. Кроме этого, если остается время, присутствует и другие: - интрес к программным и техническим новшествам - изучение профессиональной литературы - играю в бескетбол - катаюсь на лыжах - хожу на плавание - выезжаю за город с палатками - занимаюсь иногда в тренажерном зале - езжу на велосипеде - хожу на рыбалку - генерирую разряды шаровой молнии
