Repository: evtaa/FocusStartHomeworks
Catalog: homeTask1/homeTask1/Resources/*.lproj/Localizable.strings
Languages: ru

source: Car
ru: Автомобиль

source: Notification
ru: Уведомление

source: OK
ru: ОК

# failedCarManufacturer
source: You did't enter a car manufacturer.
ru: Вы не ввели производителя автомобиля

# failedCarModel
source: You didn't enter a car model.
ru: Вы не ввели модель автомобиля

# failedInputNumberCarYearOfIssue
source: You should enter number for a car year of an issue. No string.
ru: Вам следует ввести год только цифрами

# failedCountOfNumberCarYearOfIssue
source: Maximum character of year of an issue should be four.
ru: Максимальное количество символов в годе производства автомобиля должно быть четыре

source: Add
ru: Добавить

source: every
ru: Все

source: sedan
ru: Седан

source: hatchback
ru: Хэтчбэк

source: universal
ru: Универсал

source: coupe
ru: Купе

# bodySearch
source: Searching by body
ru: Поиск по кузову

# manufacturerIs
source: The manufacturer:
ru: Производитель:

# modelIs
source: The model:
ru: Модель:

# bodyIs
source: The body:
ru: Тип кузова:

# yearOfIssueIs
source: The year of an issue:
ru: Год выпуска:

# carNumberIs
source: The car number:
ru: Номер автомобиля:

source: Done
ru: Далее

# manufacturerEnter
source: Enter the car manufacturer
ru: Введите производителя автомобиля

# modelEnter
source: Enter the car model
ru: Введите модель автомобиля

# bodyEnter
source: Enter the car body
ru: Выберите кузов автомобиля

# yearOfIssueEnter
source: Enter the car year of issue
ru: Введите год выпуска авто

# carNumberEnter
source: Enter the car number
ru: Введите номер авто
